## Staging: dynamodb
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.audit_logs will be created
  + resource "aws_dynamodb_table" "audit_logs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "UserID"
      + id               = (known after apply)
      + name             = "AuditLogs"
      + range_key        = "Event#SubjectID#TimeStamp"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Event#SubjectID#TimeStamp"
          + type = "S"
        }
      + attribute {
          + name = "TimeStamp"
          + type = "N"
        }
      + attribute {
          + name = "UserID"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "UserID"
          + name               = "Archive"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + range_key          = "TimeStamp"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = "arn:aws:kms:ca-central-1:687401027353:key/1f3edb85-9eac-4da9-8c7c-43a68e339ede"
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dynamodb_audit_logs_arn        = (known after apply)
  + dynamodb_audit_logs_table_name = "AuditLogs"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
